[Killed] BlockStatement
src/utilitarios.js:2:23
 class Utilitarios {
-  inverterString(str) {
-    return str.split("").reverse().join("");
-  }
+  inverterString(str) {}
 
   contarCaracteres(str) {
killedBy: Classe Utilitarios inverterString
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ctas"
Received: undefined

[Killed] MethodExpression
src/utilitarios.js:3:12
 class Utilitarios {
   inverterString(str) {
-    return str.split("").reverse().join("");
+    return str.split("").join("");
   }
 
killedBy: Classe Utilitarios inverterString
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ctas"
Received: "satc"

[Killed] StringLiteral
src/utilitarios.js:3:41
 class Utilitarios {
   inverterString(str) {
-    return str.split("").reverse().join("");
+    return str.split("").reverse().join("Stryker was here!");
   }
 
killedBy: Classe Utilitarios inverterString
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ctas"
Received: "cStryker was here!tStryker was here!aStryker was here!s"

[Killed] BlockStatement
src/utilitarios.js:6:25
     return str.split("").reverse().join("");
   }
 
-  contarCaracteres(str) {
-    return str.length;
-  }
+  contarCaracteres(str) {}
 
   paraMaiusculas(str) {
killedBy: Classe Utilitarios contarCaracteres
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] BlockStatement
src/utilitarios.js:10:23
     return str.length;
   }
 
-  paraMaiusculas(str) {
-    return str.toUpperCase();
-  }
+  paraMaiusculas(str) {}
 
   paraMinusculas(str) {
killedBy: Classe Utilitarios paraMaiusculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SATC"
Received: undefined

[Killed] MethodExpression
src/utilitarios.js:11:12
   }
 
   paraMaiusculas(str) {
-    return str.toUpperCase();
+    return str.toLowerCase();
   }
 
killedBy: Classe Utilitarios paraMaiusculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SATC"
Received: "satc"

[Killed] BlockStatement
src/utilitarios.js:14:23
     return str.toUpperCase();
   }
 
-  paraMinusculas(str) {
-    return str.toLowerCase();
-  }
+  paraMinusculas(str) {}
 
   primeiraLetraMaiuscula(str) {
killedBy: Classe Utilitarios paraMinusculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "satc"
Received: undefined

[Killed] MethodExpression
src/utilitarios.js:15:12
   }
 
   paraMinusculas(str) {
-    return str.toLowerCase();
+    return str.toUpperCase();
   }
 
killedBy: Classe Utilitarios paraMinusculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "satc"
Received: "SATC"

[Killed] BlockStatement
src/utilitarios.js:18:31
     return str.toLowerCase();
   }
 
-  primeiraLetraMaiuscula(str) {
-    return str.charAt(0).toUpperCase() + str.slice(1);
-  }
+  primeiraLetraMaiuscula(str) {}
 
   somar(a, b) {
killedBy: Classe Utilitarios primeiraLetraMaiuscula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Satc"
Received: undefined

[Killed] MethodExpression
src/utilitarios.js:19:12
   }
 
   primeiraLetraMaiuscula(str) {
-    return str.charAt(0).toUpperCase() + str.slice(1);
+    return str.toUpperCase() + str.slice(1);
   }
 
killedBy: Classe Utilitarios primeiraLetraMaiuscula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Satc"
Received: "SATCatc"

[Killed] MethodExpression
src/utilitarios.js:19:12
   }
 
   primeiraLetraMaiuscula(str) {
-    return str.charAt(0).toUpperCase() + str.slice(1);
+    return str.charAt(0).toLowerCase() + str.slice(1);
   }
 
killedBy: Classe Utilitarios primeiraLetraMaiuscula
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Satc"
Received: "satc"

[Killed] BlockStatement
src/utilitarios.js:22:15
     return str.charAt(0).toUpperCase() + str.slice(1);
   }
 
-  somar(a, b) {
-    return a + b;
-  }
+  somar(a, b) {}
 
   subtrair(a, b) {
killedBy: Classe Utilitarios somar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ArithmeticOperator
src/utilitarios.js:23:12
   }
 
   somar(a, b) {
-    return a + b;
+    return a - b;
   }
 
killedBy: Classe Utilitarios somar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
src/utilitarios.js:26:18
     return a + b;
   }
 
-  subtrair(a, b) {
-    return a - b;
-  }
+  subtrair(a, b) {}
 
   multiplicar(a, b) {
killedBy: Classe Utilitarios subtrair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ArithmeticOperator
src/utilitarios.js:27:12
   }
 
   subtrair(a, b) {
-    return a - b;
+    return a + b;
   }
 
killedBy: Classe Utilitarios subtrair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] BlockStatement
src/utilitarios.js:30:21
     return a - b;
   }
 
-  multiplicar(a, b) {
-    return a * b;
-  }
+  multiplicar(a, b) {}
 
   dividir(a, b) {
killedBy: Classe Utilitarios multiplicar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ArithmeticOperator
src/utilitarios.js:31:12
   }
 
   multiplicar(a, b) {
-    return a * b;
+    return a / b;
   }
 
killedBy: Classe Utilitarios multiplicar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] BlockStatement
src/utilitarios.js:34:17
     return a * b;
   }
 
-  dividir(a, b) {
-    if (b === 0) throw new Error("Divisão por zero");
-    return a / b;
-  }
+  dividir(a, b) {}
 
   ehPar(num) {
killedBy: Classe Utilitarios dividir
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] EqualityOperator
src/utilitarios.js:35:9
   }
 
   dividir(a, b) {
-    if (b === 0) throw new Error("Divisão por zero");
+    if (b !== 0) throw new Error("Divisão por zero");
     return a / b;
   }
killedBy: Classe Utilitarios dividir
statusReason: Error: Divisão por zero

[Killed] ConditionalExpression
src/utilitarios.js:35:9
   }
 
   dividir(a, b) {
-    if (b === 0) throw new Error("Divisão por zero");
+    if (true) throw new Error("Divisão por zero");
     return a / b;
   }
killedBy: Classe Utilitarios dividir
statusReason: Error: Divisão por zero

[Killed] ArithmeticOperator
src/utilitarios.js:36:12
 
   dividir(a, b) {
     if (b === 0) throw new Error("Divisão por zero");
-    return a / b;
+    return a * b;
   }
 
killedBy: Classe Utilitarios dividir
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 4

[Killed] BlockStatement
src/utilitarios.js:39:14
     return a / b;
   }
 
-  ehPar(num) {
-    return num % 2 === 0;
-  }
+  ehPar(num) {}
 
   primeiroElemento(arr) {
killedBy: Classe Utilitarios ehPar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/utilitarios.js:40:12
   }
 
   ehPar(num) {
-    return num % 2 === 0;
+    return true;
   }
 
killedBy: Classe Utilitarios ehPar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/utilitarios.js:40:12
   }
 
   ehPar(num) {
-    return num % 2 === 0;
+    return num % 2 !== 0;
   }
 
killedBy: Classe Utilitarios ehPar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utilitarios.js:43:25
     return num % 2 === 0;
   }
 
-  primeiroElemento(arr) {
-    return arr[0];
-  }
+  primeiroElemento(arr) {}
 
   ultimoElemento(arr) {
killedBy: Classe Utilitarios primeiroElemento
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/utilitarios.js:47:23
     return arr[0];
   }
 
-  ultimoElemento(arr) {
-    return arr[arr.length - 1];
-  }
+  ultimoElemento(arr) {}
 
   tamanhoArray(arr) {
killedBy: Classe Utilitarios ultimoElemento
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/utilitarios.js:48:16
   }
 
   ultimoElemento(arr) {
-    return arr[arr.length - 1];
+    return arr[arr.length + 1];
   }
 
killedBy: Classe Utilitarios ultimoElemento
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/utilitarios.js:51:21
     return arr[arr.length - 1];
   }
 
-  tamanhoArray(arr) {
-    return arr.length;
-  }
+  tamanhoArray(arr) {}
 
   ordenarArray(arr) {
killedBy: Classe Utilitarios tamanhoArray
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/utilitarios.js:55:21
     return arr.length;
   }
 
-  ordenarArray(arr) {
-    return [...arr].sort();
-  }
+  ordenarArray(arr) {}
 
   inverterArray(arr) {
killedBy: Classe Utilitarios ordenarArray
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3, 4, 5, 6]
Received: undefined

[Killed] MethodExpression
src/utilitarios.js:56:12
   }
 
   ordenarArray(arr) {
-    return [...arr].sort();
+    return [...arr];
   }
 
killedBy: Classe Utilitarios ordenarArray
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    2,

[Killed] BlockStatement
src/utilitarios.js:59:22
     return [...arr].sort();
   }
 
-  inverterArray(arr) {
-    return [...arr].reverse();
-  }
+  inverterArray(arr) {}
 
   gerarNumeroAleatorio(max = 100) {
killedBy: Classe Utilitarios inverterArray
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [5, 4, 3, 2, 1]
Received: undefined

[Killed] MethodExpression
src/utilitarios.js:60:12
   }
 
   inverterArray(arr) {
-    return [...arr].reverse();
+    return [...arr];
   }
 
killedBy: Classe Utilitarios inverterArray
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   5,
-   4,

[Killed] BlockStatement
src/utilitarios.js:63:35
     return [...arr].reverse();
   }
 
-  gerarNumeroAleatorio(max = 100) {
-    return Math.floor(Math.random() * max);
-  }
+  gerarNumeroAleatorio(max = 100) {}
 
   ehNumero(valor) {
killedBy: Classe Utilitarios gerarNumeroAleatorio usa max default (100) e calcula floor(Math.random() * max)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/utilitarios.js:64:23
   }
 
   gerarNumeroAleatorio(max = 100) {
-    return Math.floor(Math.random() * max);
+    return Math.floor(Math.random() / max);
   }
 
killedBy: Classe Utilitarios gerarNumeroAleatorio usa max default (100) e calcula floor(Math.random() * max)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 0

[Killed] BlockStatement
src/utilitarios.js:67:19
     return Math.floor(Math.random() * max);
   }
 
-  ehNumero(valor) {
-    return typeof valor === "number" && !isNaN(valor);
-  }
+  ehNumero(valor) {}
 
   removerEspacos(str) {
killedBy: Classe Utilitarios ehNumero diferencia number de string numérica
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/utilitarios.js:68:12
   }
 
   ehNumero(valor) {
-    return typeof valor === "number" && !isNaN(valor);
+    return true;
   }
 
killedBy: Classe Utilitarios ehNumero diferencia number de string numérica
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utilitarios.js:68:12
   }
 
   ehNumero(valor) {
-    return typeof valor === "number" && !isNaN(valor);
+    return true && !isNaN(valor);
   }
 
killedBy: Classe Utilitarios ehNumero diferencia number de string numérica
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/utilitarios.js:71:23
     return typeof valor === "number" && !isNaN(valor);
   }
 
-  removerEspacos(str) {
-    return str.trim();
-  }
+  removerEspacos(str) {}
 
   repetirTexto(str, vezes) {
killedBy: Classe Utilitarios removerEspacos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Satc Satc"
Received: undefined

[Killed] MethodExpression
src/utilitarios.js:72:12
   }
 
   removerEspacos(str) {
-    return str.trim();
+    return str;
   }
 
killedBy: Classe Utilitarios removerEspacos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Satc Satc"
Received: "     Satc Satc        "

[Killed] BlockStatement
src/utilitarios.js:75:28
     return str.trim();
   }
 
-  repetirTexto(str, vezes) {
-    return str.repeat(vezes);
-  }
+  repetirTexto(str, vezes) {}
 
   juntarArray(arr, separador = ",") {
killedBy: Classe Utilitarios repetirTexto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SatcSatc"
Received: undefined

[Killed] BlockStatement
src/utilitarios.js:79:37
     return str.repeat(vezes);
   }
 
-  juntarArray(arr, separador = ",") {
-    return arr.join(separador);
-  }
+  juntarArray(arr, separador = ",") {}
 
   contarPalavras(str) {
killedBy: Classe Utilitarios juntarArray
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1,2,3,4,5,6"
Received: undefined

[Killed] StringLiteral
src/utilitarios.js:79:32
     return str.repeat(vezes);
   }
 
-  juntarArray(arr, separador = ",") {
+  juntarArray(arr, separador = "") {
     return arr.join(separador);
   }
killedBy: Classe Utilitarios juntarArray
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1,2,3,4,5,6"
Received: "123456"

[Killed] BlockStatement
src/utilitarios.js:83:23
     return arr.join(separador);
   }
 
-  contarPalavras(str) {
-    return str.trim().split(/\s+/).length;
-  }
+  contarPalavras(str) {}
 
   mediaArray(arr) {
killedBy: Classe Utilitarios contarPalavras - normalização de espaços ignora espaços nas pontas (trim) e colapsa múltiplos espaços (\s+)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] MethodExpression
src/utilitarios.js:84:12
   }
 
   contarPalavras(str) {
-    return str.trim().split(/\s+/).length;
+    return str.split(/\s+/).length;
   }
 
killedBy: Classe Utilitarios contarPalavras - normalização de espaços ignora espaços nas pontas (trim) e colapsa múltiplos espaços (\s+)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 5

[Killed] Regex
src/utilitarios.js:84:29
   }
 
   contarPalavras(str) {
-    return str.trim().split(/\s+/).length;
+    return str.trim().split(/\s/).length;
   }
 
killedBy: Classe Utilitarios contarPalavras - normalização de espaços ignora espaços nas pontas (trim) e colapsa múltiplos espaços (\s+)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 8

[Killed] BlockStatement
src/utilitarios.js:87:19
     return str.trim().split(/\s+/).length;
   }
 
-  mediaArray(arr) {
-    if (!arr.length) return 0;
-    return arr.reduce((a, b) => a + b, 0) / arr.length;
-  }
+  mediaArray(arr) {}
 
   removerDuplicados(arr) {
killedBy: Classe Utilitarios mediaArray retorna 0 para array vazio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/utilitarios.js:88:9
   }
 
   mediaArray(arr) {
-    if (!arr.length) return 0;
+    if (false) return 0;
     return arr.reduce((a, b) => a + b, 0) / arr.length;
   }
killedBy: Classe Utilitarios mediaArray retorna 0 para array vazio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] ConditionalExpression
src/utilitarios.js:88:9
   }
 
   mediaArray(arr) {
-    if (!arr.length) return 0;
+    if (true) return 0;
     return arr.reduce((a, b) => a + b, 0) / arr.length;
   }
killedBy: Classe Utilitarios mediaArray calcula média corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ArithmeticOperator
src/utilitarios.js:89:33
 
   mediaArray(arr) {
     if (!arr.length) return 0;
-    return arr.reduce((a, b) => a + b, 0) / arr.length;
+    return arr.reduce((a, b) => a - b, 0) / arr.length;
   }
 
killedBy: Classe Utilitarios mediaArray calcula média corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -3

[Killed] ArithmeticOperator
src/utilitarios.js:89:12
 
   mediaArray(arr) {
     if (!arr.length) return 0;
-    return arr.reduce((a, b) => a + b, 0) / arr.length;
+    return arr.reduce((a, b) => a + b, 0) * arr.length;
   }
 
killedBy: Classe Utilitarios mediaArray calcula média corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 75

[Killed] BlockStatement
src/utilitarios.js:92:26
     return arr.reduce((a, b) => a + b, 0) / arr.length;
   }
 
-  removerDuplicados(arr) {
-    return [...new Set(arr)];
-  }
+  removerDuplicados(arr) {}
 
   ehPalindromo(str) {
killedBy: Classe Utilitarios removerDuplicados
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3, 4, 5]
Received: undefined

[Killed] ArrayDeclaration
src/utilitarios.js:93:12
   }
 
   removerDuplicados(arr) {
-    return [...new Set(arr)];
+    return [];
   }
 
killedBy: Classe Utilitarios removerDuplicados
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] BlockStatement
src/utilitarios.js:96:21
     return [...new Set(arr)];
   }
 
-  ehPalindromo(str) {
-  // Stryker disable next-line MethodExpression
-  const limpo = str.toLowerCase().replace(/[\W_]/g, "");
-  return limpo === limpo.split("").reverse().join("");
-  }
+  ehPalindromo(str) {}
 
   mesclarObjetos(obj1, obj2) {
killedBy: Classe Utilitarios ehPalindromo ignora pontuação/maiúsculas e não injeta texto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] Regex
src/utilitarios.js:98:43
 
   ehPalindromo(str) {
   // Stryker disable next-line MethodExpression
-  const limpo = str.toLowerCase().replace(/[\W_]/g, "");
+  const limpo = str.toLowerCase().replace(/[\w_]/g, "");
   return limpo === limpo.split("").reverse().join("");
   }
killedBy: Classe Utilitarios ehPalindromo ignora pontuação/maiúsculas e não injeta texto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utilitarios.js:99:10
   ehPalindromo(str) {
   // Stryker disable next-line MethodExpression
   const limpo = str.toLowerCase().replace(/[\W_]/g, "");
-  return limpo === limpo.split("").reverse().join("");
+  return false;
   }
 
killedBy: Classe Utilitarios ehPalindromo ignora pontuação/maiúsculas e não injeta texto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/utilitarios.js:99:20
   ehPalindromo(str) {
   // Stryker disable next-line MethodExpression
   const limpo = str.toLowerCase().replace(/[\W_]/g, "");
-  return limpo === limpo.split("").reverse().join("");
+  return limpo === limpo.split("").join("");
   }
 
killedBy: Classe Utilitarios ehPalindromo ignora pontuação/maiúsculas e não injeta texto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/utilitarios.js:102:30
   return limpo === limpo.split("").reverse().join("");
   }
 
-  mesclarObjetos(obj1, obj2) {
-    return { ...obj1, ...obj2 };
-  }
+  mesclarObjetos(obj1, obj2) {}
 }
 
killedBy: Classe Utilitarios mesclarObjetos preserva e sobrescreve corretamente
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nome1": "Satc", "nome2": "Educação"}
Received: undefined
